src/cf/InformationRegisters/СтатусыПроверокРНПТДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПроверокРНПТДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиРНПТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентПрослеживаемость</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Comment>УПД, УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировочныйДокумент</Name>
					<Comment>УКД</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВБухучете</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбОстаткахПрослеживаемыхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбесценениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкиНДФЛДляПередачиВНалоговыйОрган</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхождениях</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОператораСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбУменьшенииНалогаПоПатенту</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляУСН</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМатериаловВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияЭкспорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДепонированиеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПеней</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДепонированнойЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаЗадолженностиНаФакторинг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоМПЗВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СведенияОбУплатеНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОСВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровВРознице</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрекращениеАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСБилетом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоОСИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоМПЗИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСписаниеДепонентовВДоходыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.КоммерческоеПредложение</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьДепонированиеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоПрочееВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОборудованияВМонтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОСОтАрендатора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКнигиУчетаДоходовИРасходовИП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоРасчетыВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляИП</v8:Type>
						<v8:Type>cfg:DocumentRef.РозничнаяПродажа</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЕНС</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСПатентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СведенияОбУдержанномНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартияМатериаловВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыНаОнлайнКассыУменьшающиеНалоги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьРасчетЕСН</v8:Type>
						<v8:Type>cfg:DocumentRef.УсловияОплатыПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКУДиР</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоОСВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереводОСВМалоценноеОборудование</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПеремещенииПрослеживаемыхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗавершениеРемонтаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоПрочееИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.АвизоРасчетыИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыПроверкиРНПТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПроверкиРНПТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проверено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекорректныйРНПТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеЗемельныхУчастков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиЛизинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиФакторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРеализацияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупТоваровКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ПроверкаРНПТПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует таблицу документов со статусами проверки РНПТ в зависимости от переданных параметров поиска.
//
// Параметры:
//  ПараметрыПоиска - Структура с полями:
//    * Организация - СправочникСсылка - ссылка на организацию, по которой происходит поиск
//    * НачалоПериода - Дата - дата начала поиска
//    * КонецПериода - Дата - дата окончания поиска
//    * Контрагент - СправочникСсылка - контрагент по которому происходит поиск (может быть пустой)
//    * НастройкаОтображенияДокументов - Число (0 - все, 1 - с ошибками, 2 - без ошибок)
//    * РежимРасшифровки - Булево - признак, необходимый для получения сведений из отчета "снаружи"
//    * ЭтоВходящийДокумент - Булево - признак того, что нужно отбирать входящие документы
//
// Возвращаемое значение:
//  ТаблицаЗначений - см. текст запроса функции
//
Функция ДокументыСоСтатусомПроверкиРНПТ(ПараметрыПоискаДокументов) Экспорт
	
	Если НЕ ПравоДоступа("Просмотр", Метаданные.Отчеты.АнализРНПТДокументов) Тогда
		// Для пользователей без доступа к отчету не получаем список документов с ошибками.
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",                    ПараметрыПоискаДокументов.Организация);
	Запрос.УстановитьПараметр("НачалоПериода",                  ПараметрыПоискаДокументов.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",                   ПараметрыПоискаДокументов.КонецПериода);
	Запрос.УстановитьПараметр("НастройкаОтображенияДокументов", ПараметрыПоискаДокументов.НастройкаОтображенияДокументов);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтатусыПроверокРНПТДокументов.Организация КАК Организация,
	|	СтатусыПроверокРНПТДокументов.Документ КАК Документ,
	|	СтатусыПроверокРНПТДокументов.Контрагент КАК Контрагент,
	|	СтатусыПроверокРНПТДокументов.СтатусПроверки КАК СтатусПроверки,
	|	ВЫБОР
	|		КОГДА СтатусыПроверокРНПТДокументов.СтатусПроверки = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиРНПТ.НекорректныйРНПТ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Ошибка,
	|	ВЫБОР
	|		КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВходящийДокумент,
	|	ДанныеПервичныхДокументов.Номер КАК Номер,
	|	ДанныеПервичныхДокументов.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.ПоступлениеТоваровУслуг).СуммаДокумента
	|		КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.РеализацияТоваровУслуг).СуммаДокумента
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.ПоступлениеТоваровУслуг).ВалютаДокумента
	|		КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.РеализацияТоваровУслуг).ВалютаДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДокумента,
	|	ТИПЗНАЧЕНИЯ(СтатусыПроверокРНПТДокументов.Документ) КАК ДокументТип,
	|	СтатусыПроверокРНПТДокументов.ОписаниеОшибки КАК ОписаниеОшибки
	|ИЗ
	|	РегистрСведений.СтатусыПроверокРНПТДокументов КАК СтатусыПроверокРНПТДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО СтатусыПроверокРНПТДокументов.Организация = ДанныеПервичныхДокументов.Организация
	|			И СтатусыПроверокРНПТДокументов.Документ = ДанныеПервичныхДокументов.Документ
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.ПоступлениеТоваровУслуг).Дата
	|			КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.РеализацияТоваровУслуг).Дата
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ >= &НачалоПериода
	|	И ВЫБОР
	|			КОГДА &КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.ПоступлениеТоваровУслуг).Дата
	|			КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.РеализацияТоваровУслуг).Дата
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ <= &КонецПериода
	|	И ВЫБОР
	|			КОГДА &НастройкаОтображенияДокументов = 0
	|				ТОГДА ИСТИНА
	|			КОГДА &НастройкаОтображенияДокументов = 1
	|				ТОГДА СтатусыПроверокРНПТДокументов.СтатусПроверки = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиРНПТ.НекорректныйРНПТ)
	|			ИНАЧЕ СтатусыПроверокРНПТДокументов.СтатусПроверки = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиРНПТ.Проверено)
	|		КОНЕЦ
	|	И ДанныеПервичныхДокументов.Организация В(&Организация)
	|	И СтатусыПроверокРНПТДокументов.Контрагент = &Контрагент
	|	И &ОтборВходящийДокумент
	|	И ВЫБОР
	|			КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|				ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.ПоступлениеТоваровУслуг).Проведен
	|			КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ТОГДА ВЫРАЗИТЬ(СтатусыПроверокРНПТДокументов.Документ КАК Документ.РеализацияТоваровУслуг).Проведен
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Документ";
	
	Если Не ЗначениеЗаполнено(ПараметрыПоискаДокументов.Организация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеПервичныхДокументов.Организация В (&Организация)", "ИСТИНА");
	КонецЕсли;
	
	// Отбор передаем из списка документов.
	Если ПараметрыПоискаДокументов.Свойство("Контрагент")
		И ЗначениеЗаполнено(ПараметрыПоискаДокументов.Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", ПараметрыПоискаДокументов.Контрагент);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтатусыПроверокРНПТДокументов.Контрагент = &Контрагент", "ИСТИНА");
	КонецЕсли;
	
	Если ПараметрыПоискаДокументов.Свойство("ЭтоВходящийДокумент") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборВходящийДокумент", 
		"ВЫБОР
		|			КОГДА СтатусыПроверокРНПТДокументов.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ = &ЭтоВходящийДокумент");
		Запрос.УстановитьПараметр("ЭтоВходящийДокумент", ПараметрыПоискаДокументов.ЭтоВходящийДокумент);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборВходящийДокумент", "ИСТИНА");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Добавляет дополнительные поля для проверки РНПТ.
//
// Параметры:
//  ТаблицаДанныеРНПТ - ТаблицаЗначений - таблица, которую необходимо дополнить реквизитами для проверки
//
Процедура ДобавитьДополнительныеКолонкиДляПроверки(ТаблицаДанныеРНПТ) Экспорт
	
	// Дополнительно сверяем код ТНВЭД и код страны происхождения
	ТаблицаДанныеРНПТ.Колонки.Добавить("КодТНВЭД", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	
КонецПроцедуры

// Заполняет дополнительные поля для проверки нужными значениями
//
// Параметры:
//  ДанныеРНПТ - ТаблицаЗначений - см.ПроверкаРНПТ.НовыйТаблицаДанныхРНПТ()
//  Параметры - ФормаКлиентскогоПриложения или Структура с полями для заполнения дополнительных колонок для проверки.
//
Процедура ЗаполнитьДополнительныеКолонкиДляПроверки(ДанныеРНПТ, Параметры) Экспорт
	
	Если ТипЗнч(Параметры) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		ДокументОбъект = Параметры.Объект;
		Если Не ДокументОбъект.Свойство("Товары") 
			И Не ДокументОбъект.Свойство("Оборудование") 
			И Не ДокументОбъект.Свойство("ОсновныеСредства")
			И Не ДокументОбъект.Свойство("Услуги") Тогда
			Возврат;
		КонецЕсли;
		
		МассивИдентификаторов = ОбщегоНазначенияБпВызовСервера.УдалитьПовторяющиесяЭлементыМассива(
			ДанныеРНПТ.ВыгрузитьКолонку("ИдентификаторСтроки"));
		ТаблицаДопРеквизитовПоИдентификатору = Новый ТаблицаЗначений;
		ТаблицаДопРеквизитовПоИдентификатору.Колонки.Добавить("ИдентификаторСтроки");
		ТаблицаДопРеквизитовПоИдентификатору.Колонки.Добавить("Номенклатура");
		
		Для Каждого ИдентификаторСтроки Из МассивИдентификаторов Цикл
			Если ДокументОбъект.Свойство("Товары") Тогда
				ДополнитьТаблицуДопРеквизитов(
					ТаблицаДопРеквизитовПоИдентификатору, ДокументОбъект, ИдентификаторСтроки, "Товары");
			КонецЕсли;
			Если ДокументОбъект.Свойство("Оборудование") Тогда
				ДополнитьТаблицуДопРеквизитов(
					ТаблицаДопРеквизитовПоИдентификатору, ДокументОбъект, ИдентификаторСтроки, "Оборудование");
			КонецЕсли;
			Если ДокументОбъект.Свойство("ОсновныеСредства") Тогда
				ДополнитьТаблицуДопРеквизитов(
				ТаблицаДопРеквизитовПоИдентификатору, ДокументОбъект, ИдентификаторСтроки, "ОсновныеСредства");
			КонецЕсли;
			Если ДокументОбъект.Свойство("Услуги") Тогда
				ДополнитьТаблицуДопРеквизитов(
				ТаблицаДопРеквизитовПоИдентификатору, ДокументОбъект, ИдентификаторСтроки, "СведенияПрослеживаемости");
			КонецЕсли;
		КонецЦикла;
		ТаблицаДопРеквизитовПоИдентификатору.Свернуть("ИдентификаторСтроки,Номенклатура");
		Номенклатура = ОбщегоНазначенияБпВызовСервера.УдалитьПовторяющиесяЭлементыМассива(
			ТаблицаДопРеквизитовПоИдентификатору.ВыгрузитьКолонку("Номенклатура"));
		ТНВЭДы = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Номенклатура, "КодТНВЭД");
		Для Каждого СтрокаТаблицыДопРеквизитов Из ТаблицаДопРеквизитовПоИдентификатору Цикл
			ИскомыеСтроки = ДанныеРНПТ.НайтиСтроки(
				Новый Структура("ИдентификаторСтроки", СтрокаТаблицыДопРеквизитов.ИдентификаторСтроки));
			Для Каждого НайденнаяСтрока Из ИскомыеСтроки Цикл
				Если Не ЗначениеЗаполнено(НайденнаяСтрока.КодТНВЭД) Тогда
					НайденнаяСтрока.КодТНВЭД               = Строка(ТНВЭДы[СтрокаТаблицыДопРеквизитов.Номенклатура]);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		ТНВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Номенклатура, "КодТНВЭД");
		ДанныеРНПТ.ЗаполнитьЗначения(ТНВЭД, "КодТНВЭД");
	КонецЕсли;

КонецПроцедуры

// Проверяет дополнительные колонки РНПТ.
//
// Параметры:
//  ПроверяемаяСтрока - Структура - строка с доп. полями по данным документа.
//  ЭталоннаяСтрока - Структура с доп. полями по данным ФНС.
//  ТолькоТекстОшибки - Булево - признак, указывающий, что процедура вызывается только для формирования текста ошибки.
//
Процедура ПроверитьДополнительныеКолонки(ПроверяемаяСтрока, ЭталоннаяСтрока, ТолькоТекстОшибки = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ПроверяемаяСтрока.КодТНВЭД)
		ИЛИ Не ЗначениеЗаполнено(ЭталоннаяСтрока.КодТНВЭД) Тогда
		// Не считаем ошибкой несовпадение ТН ВЭД если в программе или по данным ФНС он не заполнен.
		Возврат;
	КонецЕсли;
	
	// Сверяем первые 4 цифры ТН ВЭД, определяющие категорию товара.
	КатегорияТовараВПрограмме = Лев(ПроверяемаяСтрока.КодТНВЭД, 4);
	КатегорияТовараФНС        = Лев( ЭталоннаяСтрока.КодТНВЭД, 4);
	Если КатегорияТовараВПрограмме <> КатегорияТовараФНС Тогда
		ОшибкаТНВЭД = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По данным ФНС ТН ВЭД %1'"),
			ЭталоннаяСтрока.КодТНВЭД);
		ПроверяемаяСтрока.ОписаниеСостояния = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1%2%3'"),
			ПроверяемаяСтрока.ОписаниеСостояния,
			?(ЗначениеЗаполнено(ПроверяемаяСтрока.ОписаниеСостояния), ";", ""),
			ОшибкаТНВЭД);
		Если ТолькоТекстОшибки Тогда
			Возврат;
		КонецЕсли;
		ПроверяемаяСтрока.Ошибка = Истина;
		ПроверяемаяСтрока.СписокОшибок.Добавить("КодТНВЭД");
		// В пояснении показываем только подсказку по первой ошибке.
		Если НЕ ЗначениеЗаполнено(ПроверяемаяСтрока.Пояснение) Тогда
			ПроверяемаяСтрока.Пояснение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'в программе %1 - по данным ФНС %2'"), ПроверяемаяСтрока.КодТНВЭД, ЭталоннаяСтрока.КодТНВЭД);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет соответствует ли код РНПТ формату.
//
// Параметры:
//  КодРНПТ - Строка - проверяемый код
// Возвращаемое значение - Булево - истина если соответствует, ложь если не соответствует.
//
Функция РНПТСоответствуетФормату(КодРНПТ) Экспорт
	
	Возврат Справочники.НомераГТД.ЭтоРНПТ(КодРНПТ);
	
КонецФункции

// Возвращает для документа какие табличные части могут быть с прослеживаемым товаром.
//
// Параметры:
//  ДокументОбъект - проверяемы документ
// Возвращаемое значение - Массив - наименование табличных частей с прослеживаемостью
//
Функция ТабличныеЧастиДокументаСПрослеживаемостью(ДокументОбъект) Экспорт
	
	ТабличныеЧастиДокументаСПрослеживаемостью = Новый Массив;
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары
			ИЛИ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия Тогда
			ТабличныеЧастиДокументаСПрослеживаемостью.Добавить("Товары");
		ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства Тогда
			ТабличныеЧастиДокументаСПрослеживаемостью.Добавить("ОсновныеСредства");
		ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда 
			ТабличныеЧастиДокументаСПрослеживаемостью.Добавить("Оборудование");
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда 
		Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги Тогда
			ТабличныеЧастиДокументаСПрослеживаемостью.Добавить("Услуги");
		Иначе
			ТабличныеЧастиДокументаСПрослеживаемостью.Добавить("Товары");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТабличныеЧастиДокументаСПрослеживаемостью;
	
КонецФункции

// Возвращает текст запроса для проверки РНПТ документов регламентным заданием.
//
// Возвращаемое значение - Строка - текст запроса
//
Функция ТекстЗапросаПроверкиРНПТРегЗаданием() Экспорт
	
	// Отбираем для обработки порции по 500 документов.
	Возврат 
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	СтатусыПроверокРНПТДокументов.Документ КАК Документ
	|ПОМЕСТИТЬ ДокументыКПроверке
	|ИЗ
	|	РегистрСведений.СтатусыПроверокРНПТДокументов КАК СтатусыПроверокРНПТДокументов
	|ГДЕ
	|	(СтатусыПроверокРНПТДокументов.СтатусПроверки = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиРНПТ.ПустаяСсылка)
	|			ИЛИ СтатусыПроверокРНПТДокументов.СтатусПроверки = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиРНПТ.Выполняется))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыСРНПТБезСведений
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СведенияПрослеживаемости КАК ПоступлениеТоваровУслугСведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОРНПТИзФНС КАК СведенияОРНПТИзФНС
	|		ПО ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ = СведенияОРНПТИзФНС.РНПТ
	|ГДЕ
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКПроверке.Документ
	|			ИЗ
	|				ДокументыКПроверке)
	|	И ЕСТЬNULL(СведенияОРНПТИзФНС.ДатаПолученияСведений, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК РеализацияТоваровУслугСведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОРНПТИзФНС КАК СведенияОРНПТИзФНС
	|		ПО РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ = СведенияОРНПТИзФНС.РНПТ
	|ГДЕ
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКПроверке.Документ
	|			ИЗ
	|				ДокументыКПроверке)
	|	И ЕСТЬNULL(СведенияОРНПТИзФНС.ДатаПолученияСведений, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКПроверке.Документ КАК Документ
	|ПОМЕСТИТЬ ДокументыКПроверкеРегЗаданием
	|ИЗ
	|	ДокументыКПроверке КАК ДокументыКПроверке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыСРНПТБезСведений КАК ДокументыСРНПТБезСведений
	|		ПО ДокументыКПроверке.Документ = ДокументыСРНПТБезСведений.Ссылка
	|ГДЕ
	|	ДокументыСРНПТБезСведений.Ссылка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСведенияПрослеживаемости.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ПоступлениеТоваровУслугТовары.Номенклатура ЕСТЬ NULL
	|						ТОГДА ПоступлениеТоваровУслугТовары.Номенклатура.КодТНВЭД.Код
	|					ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугОборудование.Номенклатура.КодТНВЭД.Код, ПоступлениеТоваровУслугОсновныеСредства.ОсновноеСредство.КодТНВЭД.Код)
	|				КОНЕЦ
	|		ИНАЧЕ ПоступлениеТоваровУслугСведенияПрослеживаемости.Номенклатура.КодТНВЭД.Код
	|	КОНЕЦ КАК КодТНВЭД,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка.Организация КАК Организация,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(СведенияОРНПТИзФНС.ДатаПолученияСведений, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК НетСведений
	|ПОМЕСТИТЬ РНПТДокументовКПроверке
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СведенияПрослеживаемости КАК ПоступлениеТоваровУслугСведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	|			И ПоступлениеТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки = ПоступлениеТоваровУслугТовары.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|		ПО ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка = ПоступлениеТоваровУслугОборудование.Ссылка
	|			И ПоступлениеТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки = ПоступлениеТоваровУслугОборудование.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ОсновныеСредства КАК ПоступлениеТоваровУслугОсновныеСредства
	|		ПО ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка = ПоступлениеТоваровУслугОсновныеСредства.Ссылка
	|			И ПоступлениеТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки = ПоступлениеТоваровУслугОсновныеСредства.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОРНПТИзФНС КАК СведенияОРНПТИзФНС
	|		ПО ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ = СведенияОРНПТИзФНС.РНПТ
	|ГДЕ
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКПроверкеРегЗаданием.Документ
	|			ИЗ
	|				ДокументыКПроверкеРегЗаданием)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.КоличествоПрослеживаемости,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка.Организация,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСведенияПрослеживаемости.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ПоступлениеТоваровУслугТовары.Номенклатура ЕСТЬ NULL
	|						ТОГДА ПоступлениеТоваровУслугТовары.Номенклатура.КодТНВЭД.Код
	|					ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугОборудование.Номенклатура.КодТНВЭД.Код, ПоступлениеТоваровУслугОсновныеСредства.ОсновноеСредство.КодТНВЭД.Код)
	|				КОНЕЦ
	|		ИНАЧЕ ПоступлениеТоваровУслугСведенияПрослеживаемости.Номенклатура.КодТНВЭД.Код
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.КоличествоПрослеживаемости,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугСведенияПрослеживаемости.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД.Код
	|		ИНАЧЕ РеализацияТоваровУслугСведенияПрослеживаемости.Номенклатура.КодТНВЭД.Код
	|	КОНЕЦ,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка.Организация,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка.Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(СведенияОРНПТИзФНС.ДатаПолученияСведений, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК РеализацияТоваровУслугСведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка = РеализацияТоваровУслугТовары.Ссылка
	|			И РеализацияТоваровУслугСведенияПрослеживаемости.ИдентификаторСтроки = РеализацияТоваровУслугТовары.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОРНПТИзФНС КАК СведенияОРНПТИзФНС
	|		ПО РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ = СведенияОРНПТИзФНС.РНПТ
	|ГДЕ
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКПроверкеРегЗаданием.Документ
	|			ИЗ
	|				ДокументыКПроверкеРегЗаданием)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.КоличествоПрослеживаемости,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка.Организация,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугСведенияПрослеживаемости.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД.Код
	|		ИНАЧЕ РеализацияТоваровУслугСведенияПрослеживаемости.Номенклатура.КодТНВЭД.Код
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РНПТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РНПТДокументовКПроверке.Ссылка КАК Ссылка,
	|	РНПТДокументовКПроверке.РНПТ КАК РНПТ,
	|	РНПТДокументовКПроверке.Организация КАК Организация,
	|	РНПТДокументовКПроверке.Контрагент КАК Контрагент,
	|	СведенияОРНПТИзФНС.ОшибкаПроверкиРНПТ КАК ОшибкаПроверкиРНПТ,
	|	СведенияОРНПТИзФНС.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, СведенияОРНПТИзФНС.ЕдиницаИзмеренияНаименование) КАК ЕдиницаИзмерения,
	|	СведенияОРНПТИзФНС.КодТНВЭД КАК ТНВЭДФНС,
	|	СведенияОРНПТИзФНС.КоличествоТовараВвезенного КАК КоличествоФНС,
	|	РНПТДокументовКПроверке.КодТНВЭД КАК ТНВЭДДокумент,
	|	РНПТДокументовКПроверке.КоличествоПрослеживаемости КАК КоличествоДокумент
	|ИЗ
	|	РНПТДокументовКПроверке КАК РНПТДокументовКПроверке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОРНПТИзФНС КАК СведенияОРНПТИзФНС
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|			ПО СведенияОРНПТИзФНС.ЕдиницаИзмеренияКод = КлассификаторЕдиницИзмерения.Код
	|		ПО РНПТДокументовКПроверке.РНПТ = СведенияОРНПТИзФНС.РНПТ
	|
	|СГРУППИРОВАТЬ ПО
	|	РНПТДокументовКПроверке.Ссылка,
	|	РНПТДокументовКПроверке.РНПТ,
	|	РНПТДокументовКПроверке.Организация,
	|	РНПТДокументовКПроверке.Контрагент,
	|	СведенияОРНПТИзФНС.ОшибкаПроверкиРНПТ,
	|	СведенияОРНПТИзФНС.ОписаниеОшибки,
	|	СведенияОРНПТИзФНС.КодТНВЭД,
	|	СведенияОРНПТИзФНС.КоличествоТовараВвезенного,
	|	РНПТДокументовКПроверке.КодТНВЭД,
	|	РНПТДокументовКПроверке.КоличествоПрослеживаемости,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Наименование, СведенияОРНПТИзФНС.ЕдиницаИзмеренияНаименование)
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(ОшибкаПроверкиРНПТ),
	|	МАКСИМУМ(ОписаниеОшибки),
	|	МАКСИМУМ(ЕдиницаИзмерения),
	|	МАКСИМУМ(ТНВЭДФНС),
	|	МАКСИМУМ(КоличествоФНС),
	|	МАКСИМУМ(ТНВЭДДокумент),
	|	МАКСИМУМ(КоличествоДокумент)
	|ПО
	|	Ссылка,
	|	РНПТ";
	
КонецФункции

// Меняет текст запроса для получения сведений о РНПТ из ФНС
// Параметры:
//  Запрос - запрос, текст которого необходимо переопределить.
//
Процедура ПереопределитьТекстЗапросаДляПолученияСведенийОРНПТ(Запрос) Экспорт
	
	// Дополнительно получаем сведения по РНПТ из документов, по которым нет записей в регистре "Сведения о РНПТ из ФНС".
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыПроверокРНПТДокументов.Документ КАК Документ
	|ПОМЕСТИТЬ ДокументыКПроверке
	|ИЗ
	|	РегистрСведений.СтатусыПроверокРНПТДокументов КАК СтатусыПроверокРНПТДокументов
	|ГДЕ
	|	(СтатусыПроверокРНПТДокументов.СтатусПроверки = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиРНПТ.ПустаяСсылка)
	|			ИЛИ СтатусыПроверокРНПТДокументов.СтатусПроверки = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиРНПТ.Выполняется))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОРНПТИзФНС.РНПТ КАК РНПТ,
	|	СведенияОРНПТИзФНС.КодРНПТ КАК КодРНПТ,
	|	СведенияОРНПТИзФНС.ДатаПолученияСведений КАК ДатаПолученияСведений
	|ПОМЕСТИТЬ ТаблицаРНПТПредварительная
	|ИЗ
	|	РегистрСведений.СведенияОРНПТИзФНС КАК СведенияОРНПТИзФНС
	|ГДЕ
	|	СведенияОРНПТИзФНС.ДатаПолученияСведений = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ,
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ.Код,
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СведенияПрослеживаемости КАК ПоступлениеТоваровУслугСведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОРНПТИзФНС КАК СведенияОРНПТИзФНС
	|		ПО ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ = СведенияОРНПТИзФНС.РНПТ
	|ГДЕ
	|	ПоступлениеТоваровУслугСведенияПрослеживаемости.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКПроверке.Документ
	|			ИЗ
	|				ДокументыКПроверке)
	|	И СведенияОРНПТИзФНС.ДатаПолученияСведений ЕСТЬ NULL
	|	И ПоступлениеТоваровУслугСведенияПрослеживаемости.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ,
	|	РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ.Код,
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СведенияПрослеживаемости КАК РеализацияТоваровУслугСведенияПрослеживаемости
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОРНПТИзФНС КАК СведенияОРНПТИзФНС
	|		ПО РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ = СведенияОРНПТИзФНС.РНПТ
	|ГДЕ
	|	РеализацияТоваровУслугСведенияПрослеживаемости.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКПроверке.Документ
	|			ИЗ
	|				ДокументыКПроверке)
	|	И СведенияОРНПТИзФНС.ДатаПолученияСведений ЕСТЬ NULL
	|	И РеализацияТоваровУслугСведенияПрослеживаемости.РНПТ <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 500
	|	ТаблицаРНПТПредварительная.РНПТ КАК РНПТ,
	|	ТаблицаРНПТПредварительная.КодРНПТ КАК КодРНПТ,
	|	ТаблицаРНПТПредварительная.ДатаПолученияСведений КАК ДатаПолученияСведений
	|ИЗ
	|	ТаблицаРНПТПредварительная КАК ТаблицаРНПТПредварительная";
	
КонецПроцедуры

// Возвращает тип справочника РНПТ.
//
// Возвращаемое значение - Тип - тип справочника РНПТ
//
Функция ТипСправочникаРНПТ() Экспорт
	
	Возврат Тип("СправочникСсылка.НомераГТД");
	
КонецФункции

// Ищет элемент справочника РНПТ по коду.
// 
// Параметры:
// КодРНПТ - строка - код РНПТ элемента справочника.
// 
// Возвращаемое значение - СправочникСсылка - ссылка на элемент справочника РНПТ
//
Функция РНПТПоКоду(КодРНПТ) Экспорт
	
	Возврат Справочники.НомераГТД.НайтиПоКоду(КодРНПТ);
	
КонецФункции

// Возвращает текст запроса для получения кода РНПТ.
//
// Возвращаемое значение - Строка - текст запроса
//
Функция ТекстПолученияКодаРНПТВЗапросе() Экспорт
	
	Возврат "ВЫРАЗИТЬ(ДанныеРНПТ.РНПТ КАК Справочник.НомераГТД).Код";
	
КонецФункции

// Удаляет повторяющиеся элементы массива.
//
// Параметры:
//  ОбрабатываемыйМассив - Массив - элементы произвольных типов, из которых удаляются неуникальные.
//
// Возвращаемое значение:
//   Массив      - элементы ОбрабатываемыйМассив после удаления лишних.
//
Функция УдалитьПовторяющиесяЭлементыМассива(ОбрабатываемыйМассив) Экспорт
	Возврат ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(ОбрабатываемыйМассив);
КонецФункции

// Проверяет есть ли прослеживаемые товары в документе
//
// Параметры:
// ДокументОбъект - документ, который требуется проверить
//
// Возвращаемое значение - Булево - признак того, что в документе есть прослеживаемые товары
//
Функция ЕстьПрослеживаемыеТовары(ДокументОбъект) Экспорт
	
	Возврат ДокументОбъект.СведенияПрослеживаемости.Количество() > 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьТаблицуДопРеквизитов(ТаблицаДопРеквизитовПоИдентификатору, ДокументОбъект, ИдентификаторСтроки, ИмяТабличнойЧасти)
	
	ИскомыеТовары = ДокументОбъект[ИмяТабличнойЧасти].НайтиСтроки(
		Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	Если ИскомыеТовары.Количество() <> 0 Тогда
		СтрокаТаблицыДопРеквизитов = ТаблицаДопРеквизитовПоИдентификатору.Добавить();
		СтрокаТаблицыДопРеквизитов.ИдентификаторСтроки = ИдентификаторСтроки;
		Если ИмяТабличнойЧасти = "ОсновныеСредства" Тогда
			СтрокаТаблицыДопРеквизитов.Номенклатура = ИскомыеТовары[0].ОсновноеСредство;
		Иначе
			СтрокаТаблицыДопРеквизитов.Номенклатура = ИскомыеТовары[0].Номенклатура;
		КонецЕсли;
	Конецесли;
	
КонецПроцедуры

#КонецОбласти
